app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY "events"."date" ASC
---
  def index
    #@events = Event.all
    @events = Event.order(:date)

INSERT INTO "events" ("title", "description", "picture", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Beach Party"], ["description", "Party at Sentosa"], ["picture", "ocean.jpeg"], ["date", "12/12/2016"], ["created_at", 2016-08-17 04:18:27 UTC], ["updated_at", 2016-08-17 04:18:27 UTC]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "High Tea @ Duxton"], ["description", "Enjoy sweet and savoury flavours of cakes from the finest corners of the world. "], ["updated_at", 2016-08-17 07:01:48 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)